# 1.- Introducción a Pandas Dataframe

* Tabla organizada por filas y columnas.
* Capacidad de realizar operaciones entre las columnas y de crear nuevas columnas a partir de las ya existentes.
* Integración con tipos de archivo como CSV
* Gran cantidad de métodos: filtros de información, estadísticos, gráficos, etc.

In [1]:
import pandas as pd

## Crear un dataframe vacío

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

## Crear un dataframe con información

In [5]:
df = pd.DataFrame(columns=["Animales", "Alas", "Brazos", "Patas"], data=[["Gorila", 0, 2, 2], ["Tigre", 0, 0, 4], ["Loro", 2, 0, 2], ["Araña", 0, 0, 8]])

In [6]:
df

  Animales  Alas  Brazos  Patas
0   Gorila     0       2      2
1    Tigre     0       0      4
2     Loro     2       0      2
3    Araña     0       0      8

In [7]:
df = pd.DataFrame({"Animales": ["Gorila", "Tigre", "Loro", "Araña"], "Alas": [0, 0, 2, 0], "Brazos": [2, 0, 0, 0], "Patas": [2, 4, 2, 8]})

In [8]:
df

  Animales  Alas  Brazos  Patas
0   Gorila     0       2      2
1    Tigre     0       0      4
2     Loro     2       0      2
3    Araña     0       0      8

## Crear nuevas columnas a partir de columnas existentes

In [9]:
df["Extremidades"] = df["Alas"] + df["Brazos"] + df["Patas"]

In [10]:
df

  Animales  Alas  Brazos  Patas  Extremidades
0   Gorila     0       2      2             4
1    Tigre     0       0      4             4
2     Loro     2       0      2             4
3    Araña     0       0      8             8

## Guardar un dataframe en un archivo CSV

In [11]:
df.to_csv("animales.csv", index=False)

## Leer un archivo CSV en un dataframe

In [12]:
animales = pd.read_csv("animales.csv")

In [13]:
animales

  Animales  Alas  Brazos  Patas  Extremidades
0   Gorila     0       2      2             4
1    Tigre     0       0      4             4
2     Loro     2       0      2             4
3    Araña     0       0      8             8

In [14]:
ciudades_sudamerica = pd.read_csv("ciudades_sudamerica.csv")

In [15]:
ciudades_sudamerica

                  Ciudad       Pais  Poblacion
0               Acarigua  Venezuela     143704
1             Alagoinhas     Brazil     122688
2               Alegrete     Brazil      87236
3    Almirante Tamandare     Brazil      89499
4           Alto Barinas  Venezuela     284289
..                   ...        ...        ...
495        Volta Redonda     Brazil     249580
496           Votorantim     Brazil      99390
497            Yaritagua  Venezuela      89662
498               Zarate  Argentina      88781
499            Zipaquira   Colombia      91235

[500 rows x 3 columns]